Revit 2027 API
ParameterTypeId.StructuralAttachmentEndValueRatio Property
 "End attachment ratio"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentEndValueRatio { get; }
Public Shared ReadOnly Property StructuralAttachmentEndValueRatio As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentEndValueRatio {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentEndValueRatio : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace